Autodesk.Revit.DB.ViewCropRegionShapeManager.GetCropRegionShape
Gets the crop boundary.
Returns:
The crop boundary.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropRegionEmptyShape
Sets crop region of empty shape making possible interactive sketching.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropRegionShape(Autodesk.Revit.DB.CurveLoop)
Sets the boundary of the view's crop to the specified shape.
boundary:
The crop boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Boundary in boundary should represent one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.Valid
Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
Since:
2014